; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v6 - type_3 ?v7 - type_1)
 	      (pred_1 ?v5 - object ?v7 - type_1)
	      (pred_4 ?v6 - type_3 ?v1 - type_2)
	      (pred_3 ?v6 - type_3 ?v5 - object ?v1 - type_2))

   (:action op_1
       :parameters  (?v6 - type_3 ?v8 ?v3 - type_1)
       :precondition (and  (pred_2 ?v6 ?v8))
       :effect (and  (pred_2 ?v6 ?v3)
		     (not (pred_2 ?v6 ?v8))))

   (:action op_2
       :parameters (?v6 - type_3 ?v4 - object ?v2 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_1 ?v4 ?v2) (pred_2 ?v6 ?v2) (pred_4 ?v6 ?v1))
       :effect (and (pred_3 ?v6 ?v4 ?v1)
		    (not (pred_1 ?v4 ?v2)) 
		    (not (pred_4 ?v6 ?v1))))

   (:action op_3
       :parameters (?v6 - type_3 ?v4 - object ?v2 - type_1 ?v1 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v4 ?v1) (pred_2 ?v6 ?v2))
       :effect (and (pred_1 ?v4 ?v2)
		    (pred_4 ?v6 ?v1)
		    (not (pred_3 ?v6 ?v4 ?v1)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_07 - type_3
obj_09 obj_03 - type_2
obj_05 obj_04 obj_01 obj_06 - type_1
obj_10 obj_02 obj_08 - object)
(:init
(pred_2 obj_07 obj_06)
(pred_4 obj_07 obj_09)
(pred_4 obj_07 obj_03)
(pred_1 obj_10 obj_05)
(pred_1 obj_02 obj_05)
(pred_1 obj_08 obj_05)
)
(:goal
(and
(pred_1 obj_10 obj_05)
(pred_1 obj_02 obj_06)
(pred_1 obj_08 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_07 ?b obj_03))))
)
)

; plan
1. (op_1 obj_07 obj_06 obj_05)
   deleted: (pred_2 obj_07 obj_06)
   added: (pred_2 obj_07 obj_05)
   goals met: 2 of 3
2. (op_2 obj_07 obj_02 obj_05 obj_09)
   deleted: (pred_1 obj_02 obj_05) (pred_4 obj_07 obj_09)
   added: (pred_3 obj_07 obj_02 obj_09)
   goals met: 2 of 3
3. (op_1 obj_07 obj_05 obj_06)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_06)
   goals met: 2 of 3
4. (op_3 obj_07 obj_02 obj_06 obj_09)
   deleted: (pred_3 obj_07 obj_02 obj_09)
   added: (pred_1 obj_02 obj_06) (pred_4 obj_07 obj_09)
   goals met: 3 of 3
